; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	image2 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(have_image Star6 image2)
	(have_image Star7 image2)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 image2)
	(have_image Phenomenon10 image2)
	(have_image Phenomenon11 image2)
	(have_image Star12 image2)
	(have_image Phenomenon13 image2)
	(have_image Star14 spectrograph0)
	(have_image Planet15 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation5 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 10
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon13 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon13 instrument1 image2)
   added: (have_image phenomenon13 image2)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon11 instrument1 image2)
   added: (have_image phenomenon11 image2)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 10
9. (take_image satellite1 phenomenon10 instrument1 image2)
   added: (have_image phenomenon10 image2)
   goals met: 3 of 10
10. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 10
11. (take_image satellite1 phenomenon8 instrument1 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 10
12. (turn_to satellite1 planet15 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet15)
   goals met: 4 of 10
13. (take_image satellite1 planet15 instrument1 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 5 of 10
14. (turn_to satellite1 planet9 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet9)
   goals met: 5 of 10
15. (take_image satellite1 planet9 instrument1 image2)
   added: (have_image planet9 image2)
   goals met: 6 of 10
16. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 6 of 10
17. (take_image satellite1 star12 instrument1 image2)
   added: (have_image star12 image2)
   goals met: 7 of 10
18. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 7 of 10
19. (take_image satellite1 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 8 of 10
20. (turn_to satellite1 star6 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star6)
   goals met: 8 of 10
21. (take_image satellite1 star6 instrument1 image2)
   added: (have_image star6 image2)
   goals met: 9 of 10
22. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 9 of 10
23. (take_image satellite1 star7 instrument1 image2)
   added: (have_image star7 image2)
   goals met: 10 of 10
